# SpaceHeatingSetPoint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpaceHeatingSetPoint Property
ParameterTypeId Class See Also
---
"Heating Set Point"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpaceHeatingSetPoint { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceHeatingSetPoint As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpaceHeatingSetPoint {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace